AutelSDK/Payload-SDK/samples/rtos/sample_c/platform/rtos_freertos/hc32f460/03_boot/bsp/bsp_gpio.h
#ifndef __BSP_GPIO_H__
#define __BSP_GPIO_H__

#include "hc32_ll.h"

#define  MOS_CTRL1_PORT        (GPIO_PORT_B)
#define  MOS_CTRL1_PIN         (GPIO_PIN_14)

#define  MOS_CTRL2_PORT        (GPIO_PORT_B)
#define  MOS_CTRL2_PIN         (GPIO_PIN_15)

#define  MOS_CTRL3_PORT        (GPIO_PORT_B)
#define  MOS_CTRL3_PIN         (GPIO_PIN_13)

#define  MOS_CTRL4_PORT        (GPIO_PORT_B)
#define  MOS_CTRL4_PIN         (GPIO_PIN_12)

#define  IO_DET1_PORT          (GPIO_PORT_B)
#define  IO_DET1_PIN           (GPIO_PIN_06)
#define  IO_DET1_INT_PORT       INT_SRC_PORT_EIRQ6
#define  IO_DET1_IRQn           INT006_IRQn
#define  IO_DET1_ExtiCh 				EXTINT_CH06

#define  IO_DET2_PORT          (GPIO_PORT_B)
#define  IO_DET2_PIN           (GPIO_PIN_07)
#define  IO_DET2_INT_PORT       INT_SRC_PORT_EIRQ7
#define  IO_DET2_IRQn           INT007_IRQn
#define  IO_DET2_ExtiCh 				EXTINT_CH07

#define  IO_DET3_PORT          (GPIO_PORT_B)
#define  IO_DET3_PIN           (GPIO_PIN_08)
#define  IO_DET3_INT_PORT       INT_SRC_PORT_EIRQ8
#define  IO_DET3_IRQn           INT008_IRQn
#define  IO_DET3_ExtiCh 				EXTINT_CH08

#define  IO_DET4_PORT          (GPIO_PORT_B)
#define  IO_DET4_PIN           (GPIO_PIN_09)
#define  IO_DET4_INT_PORT       INT_SRC_PORT_EIRQ9
#define  IO_DET4_IRQn           INT009_IRQn
#define  IO_DET4_ExtiCh 				EXTINT_CH09

/* LED0~3 toggle definition */

#define CTRL1_SET GPIO_SetPins(MOS_CTRL1_PORT,MOS_CTRL1_PIN);
#define CTRL1_RESET GPIO_ResetPins(MOS_CTRL1_PORT,MOS_CTRL1_PIN);

#define CTRL2_SET GPIO_SetPins(MOS_CTRL2_PORT,MOS_CTRL2_PIN);
#define CTRL2_RESET GPIO_ResetPins(MOS_CTRL2_PORT,MOS_CTRL2_PIN);

#define CTRL3_SET GPIO_SetPins(MOS_CTRL3_PORT,MOS_CTRL3_PIN);
#define CTRL3_RESET GPIO_ResetPins(MOS_CTRL3_PORT,MOS_CTRL3_PIN);

#define CTRL4_SET GPIO_SetPins(MOS_CTRL4_PORT,MOS_CTRL4_PIN);
#define CTRL4_RESET GPIO_ResetPins(MOS_CTRL4_PORT,MOS_CTRL4_PIN);


void bsp_gpio_init(void);

uint8_t get_gpio_status(void);

void set_gpio(uint8_t ctrl);
void reset_gpio(uint8_t ctrl);

#endif

